randread/128_node/job_1470987_fiojob_16/nid00098_fiojob_16/output.log
test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=256
...
fio-3.27
Starting 16 processes
rand-read: Laying out IO file (1 file / 1024MiB)
rand-read: Laying out IO file (1 file / 1024MiB)
rand-read: Laying out IO file (1 file / 1024MiB)
[...]

test: (groupid=0, jobs=16): err= 0: pid=201504: Mon Jul 19 22:15:36 2021
  read: IOPS=700, BW=2803KiB/s (2870kB/s)(821MiB/300043msec)
    slat (usec): min=1189, max=273224, avg=22808.27, stdev=14007.58
    clat (usec): min=15, max=7528.4k, avg=5768930.74, stdev=617342.85
     lat (msec): min=9, max=7555, avg=5791.74, stdev=618.24
    clat percentiles (msec):
     |  1.00th=[ 2836],  5.00th=[ 5067], 10.00th=[ 5269], 20.00th=[ 5470],
     | 30.00th=[ 5604], 40.00th=[ 5738], 50.00th=[ 5805], 60.00th=[ 5940],
     | 70.00th=[ 6007], 80.00th=[ 6141], 90.00th=[ 6342], 95.00th=[ 6477],
     | 99.00th=[ 6812], 99.50th=[ 6879], 99.90th=[ 7080], 99.95th=[ 7215],
     | 99.99th=[ 7416]
   bw (  KiB/s): min= 1288, max= 3936, per=99.87%, avg=2799.84, stdev=23.26, samples=9409
   iops        : min=  322, max=  984, avg=699.96, stdev= 5.81, samples=9409
  lat (usec)   : 20=0.01%, 50=0.01%
  lat (msec)   : 10=0.01%, 20=0.01%, 50=0.01%, 100=0.02%, 250=0.05%
  lat (msec)   : 500=0.08%, 750=0.08%, 1000=0.09%, 2000=0.35%, >=2000=99.30%
  cpu          : usr=0.12%, sys=0.78%, ctx=210377, majf=0, minf=4719
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=99.5%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=210231,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=256

Run status group 0 (all jobs):
   READ: bw=2803KiB/s (2870kB/s), 2803KiB/s-2803KiB/s (2870kB/s-2870kB/s), io=821MiB (861MB), run=300043-300043msec